itests/standalone/examples/src/main/resources/jaxws/soap-request-greet.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jax="http://jaxws.examples.camel.wildfly.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <jax:greet>
            <name>Kermit</name>
        </jax:greet>
    </soapenv:Body>
</soapenv:Envelope>
